# Atividade Pr√°tica 05

Isabella Menezes Ramos 3474

In [25]:
import pandas as pd

In [26]:
df = pd.read_excel('http://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx',index_col=False, squeeze=True)

In [27]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [28]:
df.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID            float64
Country                object
dtype: object

In [29]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,"17,850.00",United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,"17,850.00",United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom

In [30]:
df.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,"12,680.00",France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,"12,680.00",France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,"12,680.00",France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,"12,680.00",France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,"12,680.00",France

In [31]:
len(df)

541909

In [32]:
df.shape

(541909, 8)

In [33]:
df['Description'].value_counts()

WHITE HANGING HEART T-LIGHT HOLDER     2369
REGENCY CAKESTAND 3 TIER               2200
JUMBO BAG RED RETROSPOT                2159
PARTY BUNTING                          1727
LUNCH BAG RED RETROSPOT                1638
                                       ...
PINK POLKADOT KIDS BAG                    1
wrong barcode (22467)                     1
DAMAGED                                   1
CHRISTMAS TABLE CANDLE SILVER SPIKE       1
PINK MARSHMALLOW SCARF KNITTING KIT       1
Name: Description, Length: 4223, dtype: int64

In [34]:
pd.options.display.float_format = '{:,.5f}'.format

print(df['Description'].value_counts(normalize=True))

pd.options.display.float_format = '{:,.2f}'.format

WHITE HANGING HEART T-LIGHT HOLDER    0.00438
REGENCY CAKESTAND 3 TIER              0.00407
JUMBO BAG RED RETROSPOT               0.00399
PARTY BUNTING                         0.00320
LUNCH BAG RED RETROSPOT               0.00303
                                        ...
PINK POLKADOT KIDS BAG                0.00000
wrong barcode (22467)                 0.00000
DAMAGED                               0.00000
CHRISTMAS TABLE CANDLE SILVER SPIKE   0.00000
PINK MARSHMALLOW SCARF KNITTING KIT   0.00000
Name: Description, Length: 4223, dtype: float64

In [35]:
pd.isnull(df.Description).value_counts()

False    540455
True       1454
Name: Description, dtype: int64

In [36]:
df.dropna(axis=0, subset=['Description'], inplace=True)

pd.isnull(df.Description).value_counts()

False    540455
Name: Description, dtype: int64

In [37]:
df.iloc[0]

InvoiceNo                                  536365
StockCode                                  85123A
Description    WHITE HANGING HEART T-LIGHT HOLDER
Quantity                                        6
InvoiceDate                   2010-12-01 08:26:00
UnitPrice                                    2.55
CustomerID                              17,850.00
Country                            United Kingdom
Name: 0, dtype: object

In [38]:
df.iloc[0:3]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,"17,850.00",United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,"17,850.00",United Kingdom

In [39]:
df[['Description']].head()

                           Description
0   WHITE HANGING HEART T-LIGHT HOLDER
1                  WHITE METAL LANTERN
2       CREAM CUPID HEARTS COAT HANGER
3  KNITTED UNION FLAG HOT WATER BOTTLE
4       RED WOOLLY HOTTIE WHITE HEART.

In [40]:
df[['InvoiceNo','Description']].head()

  InvoiceNo                          Description
0    536365   WHITE HANGING HEART T-LIGHT HOLDER
1    536365                  WHITE METAL LANTERN
2    536365       CREAM CUPID HEARTS COAT HANGER
3    536365  KNITTED UNION FLAG HOT WATER BOTTLE
4    536365       RED WOOLLY HOTTIE WHITE HEART.

In [42]:
df.loc[0,'Description']

'WHITE HANGING HEART T-LIGHT HOLDER'

In [43]:
df[df['Description'] == 'WHITE HANGING HEART T-LIGHT HOLDER'].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,"17,850.00",United Kingdom
49,536373,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 09:02:00,2.55,"17,850.00",United Kingdom
66,536375,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 09:32:00,2.55,"17,850.00",United Kingdom
220,536390,85123A,WHITE HANGING HEART T-LIGHT HOLDER,64,2010-12-01 10:19:00,2.55,"17,511.00",United Kingdom
262,536394,85123A,WHITE HANGING HEART T-LIGHT HOLDER,32,2010-12-01 10:39:00,2.55,"13,408.00",United Kingdom

In [44]:
df[(df['Description'] == 'WHITE HANGING HEART T-LIGHT HOLDER') & (df['Quantity'] > 20)].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
220,536390,85123A,WHITE HANGING HEART T-LIGHT HOLDER,64,2010-12-01 10:19:00,2.55,"17,511.00",United Kingdom
262,536394,85123A,WHITE HANGING HEART T-LIGHT HOLDER,32,2010-12-01 10:39:00,2.55,"13,408.00",United Kingdom
1440,536542,85123A,WHITE HANGING HEART T-LIGHT HOLDER,32,2010-12-01 14:11:00,2.95,"16,456.00",United Kingdom
2306,536575,85123A,WHITE HANGING HEART T-LIGHT HOLDER,128,2010-12-01 16:01:00,2.55,"13,777.00",United Kingdom
2318,536576,85123A,WHITE HANGING HEART T-LIGHT HOLDER,128,2010-12-01 16:11:00,2.55,"13,777.00",United Kingdom

In [45]:
df[((df['Description'] == 'WHITE METAL LANTERN')|(df['Description'] == 'RED WOOLLY HOTTIE WHITE HEART.')) & (df['Quantity'] > 20)].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
869,536477,84029E,RED WOOLLY HOTTIE WHITE HEART.,24,2010-12-01 12:27:00,3.39,"16,210.00",United Kingdom
2312,536576,84029E,RED WOOLLY HOTTIE WHITE HEART.,96,2010-12-01 16:11:00,2.95,"13,777.00",United Kingdom
2364,536584,84029E,RED WOOLLY HOTTIE WHITE HEART.,384,2010-12-01 16:22:00,2.95,"13,777.00",United Kingdom
4791,536804,84029E,RED WOOLLY HOTTIE WHITE HEART.,48,2010-12-02 16:34:00,3.39,"14,031.00",United Kingdom
6945,536982,84029E,RED WOOLLY HOTTIE WHITE HEART.,108,2010-12-03 14:27:00,8.47,nan,United Kingdom

In [46]:
df[df['Description'] == 'WHITE METAL LANTERN'][['InvoiceNo']].head()

    InvoiceNo
1      536365
50     536373
67     536375
279    536396
417    536406

In [47]:
df['TotalPrice'] = df['Quantity'] * df['UnitPrice']
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,"17,850.00",United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,"17,850.00",United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom,20.34

In [48]:
df2 = df.drop(0)
df2.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,"17,850.00",United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom,20.34
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,2010-12-01 08:26:00,7.65,"17,850.00",United Kingdom,15.30

In [49]:
df2 = df2.drop(['TotalPrice'], axis = 1)
df2.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,"17,850.00",United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,"17,850.00",United Kingdom
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,2010-12-01 08:26:00,7.65,"17,850.00",United Kingdom

In [50]:
df = df.set_index('InvoiceNo')
df.loc[536366]

,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
InvoiceNo,,,,,,,,
536366,22633,HAND WARMER UNION JACK,6,2010-12-01 08:28:00,1.85,"17,850.00",United Kingdom,11.10
536366,22632,HAND WARMER RED POLKA DOT,6,2010-12-01 08:28:00,1.85,"17,850.00",United Kingdom,11.10

In [52]:
df.loc[[536366,536373]]

,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
InvoiceNo,,,,,,,,
536366,22633,HAND WARMER UNION JACK,6,2010-12-01 08:28:00,1.85,"17,850.00",United Kingdom,11.10
536366,22632,HAND WARMER RED POLKA DOT,6,2010-12-01 08:28:00,1.85,"17,850.00",United Kingdom,11.10
536373,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 09:02:00,2.55,"17,850.00",United Kingdom,15.30
536373,71053,WHITE METAL LANTERN,6,2010-12-01 09:02:00,3.39,"17,850.00",United Kingdom,20.34
536373,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 09:02:00,2.75,"17,850.00",United Kingdom,22.00
536373,20679,EDWARDIAN PARASOL RED,6,2010-12-01 09:02:00,4.95,"17,850.00",United Kingdom,29.70
536373,37370,RETRO COFFEE MUGS ASSORTED,6,2010-12-01 09:02:00,1.06,"17,850.00",United Kingdom,6.36
536373,21871,SAVE THE PLANET MUG,6,2010-12-01 09:02:00,1.06,"17,850.00",United Kingdom,6.36
536373,21071,VINTAGE BILLBOARD DRINK ME MUG,6,2010-12-01 09:02:00,1.06,"17,850.00",United Kingdom,6.36
536373,21068,VINTAGE BILLBOARD LOVE/HATE MUG,6,2010-12-01 09:02:00,1.06,"17,850.00",United Kingdom,6.36
536373,82483,WOOD 2 DRAWER CABINET WHITE FINISH,2,2010-12-01 09:02:00,4.95,"17,850.00",United Kingdom,9.90
536373,82486,WOOD S/3 CABINET ANT WHITE FINISH,4,2010-12-01 09:02:00,6.95,"17,850.00",United Kingdom,27.80
536373,82482,WOODEN PICTURE FRAME WHITE FINISH,6,2010-12-01 09:02:00,2.10,"17,850.00",United Kingdom,12.60
536373,82494L,WOODEN FRAME ANTIQUE WHITE,6,2010-12-01 09:02:00,2.55,"17,850.00",United Kingdom,15.30
536373,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 09:02:00,3.39,"17,850.00",United Kingdom,20.34
536373,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 09:02:00,3.39,"17,850.00",United Kingdom,20.34
536373,22752,SET 7 BABUSHKA NESTING BOXES,2,2010-12-01 09:02:00,7.65,"17,850.00",United Kingdom,15.30
536373,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,2010-12-01 09:02:00,4.25,"17,850.00",United Kingdom,25.50

In [53]:
df.index

Index([536365, 536365, 536365, 536365, 536365, 536365, 536365, 536366, 536366,
       536367,
       ...
       581587, 581587, 581587, 581587, 581587, 581587, 581587, 581587, 581587,
       581587],
      dtype='object', name='InvoiceNo', length=540455)

In [54]:
df = df.reset_index()
df.index

RangeIndex(start=0, stop=540455, step=1)

In [56]:
df['UnitPrice'].mean()

4.623519023780458

In [57]:
df['UnitPrice'].median()

2.08

In [58]:
df['UnitPrice'].std()

96.88962764990177

In [59]:
df['UnitPrice'].describe()

count   540,455.00
mean          4.62
std          96.89
min     -11,062.06
25%           1.25
50%           2.08
75%           4.13
max      38,970.00
Name: UnitPrice, dtype: float64

In [60]:
df[df['Description'] == 'HAND WARMER UNION JACK']['UnitPrice'].mean()

2.1932427184466103

In [61]:
df[df['Description'] == 'HAND WARMER UNION JACK']['UnitPrice'].median()

2.1

In [62]:
df[df['Description'] == 'HAND WARMER UNION JACK']['UnitPrice'].std()

0.47125852831138676

In [63]:
grouped_description = df.groupby('Description')

In [64]:
grouped_description['UnitPrice'].count().head()

Description
20713                               1
 4 PURPLE FLOCK DINNER CANDLES     41
 50'S CHRISTMAS GIFT BAG LARGE    130
 DOLLY GIRL BEAKER                181
 I LOVE LONDON MINI BACKPACK       88
Name: UnitPrice, dtype: int64

In [81]:
df3 = pd.read_excel('http://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx',index_col=False, squeeze=True)

# Atividade

## 1. Quantos objetos do conjunto de dados possuem o valor do atributo InvoiceNo ausente ou nulo?

In [82]:
df3['InvoiceNo'].isnull().sum()

0

## 2. Quantos objetos do conjunto de dados possuem o valor do atributo UnitPrice menor que zero? Apague esses objetos do conjunto de dados.

In [83]:
df3[df3['UnitPrice'] <0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
299983,A563186,B,Adjust bad debt,1,2011-08-12 14:51:00,"-11,062.06",nan,United Kingdom
299984,A563187,B,Adjust bad debt,1,2011-08-12 14:52:00,"-11,062.06",nan,United Kingdom

In [84]:
aux = df3[df3['UnitPrice'] <0]
df3 = df3.drop(aux.index)
df3[df3['UnitPrice'] <0]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

## 3. Qual o cliente (atributo CustomerId) que comprou mais itens, sendo que cada linha representa um item comprado?

In [95]:
df3.groupby('CustomerID')['Quantity'].count().sort_values().tail(1)

CustomerID
17,841.00    7983
Name: Quantity, dtype: int64

## 4. Qual o produto mais caro vendido?

In [97]:
df3['UnitPrice'].sort_values().tail(1)

222681   38,970.00
Name: UnitPrice, dtype: float64

## 5. Quais os pa√≠ses (Country) que fazem parte deste conjunto de dados?

In [100]:
df3['Country'].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', 'United Arab Emirates', 'Saudi Arabia',
       'Czech Republic', 'Canada', 'Unspecified', 'Brazil', 'USA',
       'European Community', 'Malta', 'RSA'], dtype=object)

## 6. Qual a compra (InvoiceNo) que possui mais itens?

In [108]:
df3.groupby('InvoiceNo')['Quantity'].sum().sort_values().tail(1)

InvoiceNo
581483    80995
Name: Quantity, dtype: int64

## 7. Qual a compra (InvoiceNo) que tem o maior valor total?

In [113]:
df3['price'] = df3['Quantity'] * df3['UnitPrice']
df3.groupby('InvoiceNo')['price'].sum().sort_values().tail(1)

InvoiceNo
581483   168,469.60
Name: price, dtype: float64